In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
#Ans1:
df.loc[[1]]

        course_name  duration
1  Machine Learning         3

In [4]:
#Ans2: (i). loc:- It is the function which is used to index any dataframe by using the rows and columns names. And passing them to the function itself.
#    (ii). iloc:- It is the function which is used to do indexing of a dataframe by using the integer indexes of rows and columns.

In [5]:
#Ans3:
reindex=[3,0,1,2]
new_df=df.reindex(reindex)

In [6]:
new_df.loc[[2]]

  course_name  duration
2    Big Data         6

In [7]:
new_df.iloc[[2]]

        course_name  duration
1  Machine Learning         3

In [8]:
# loc gives output by finding the row name '2' in the dataframe, while iloc gives output by finding the natural index of 2nd row.

In [9]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.187385  0.313003  0.073972  0.933580  0.396786  0.190883
2  0.569959  0.938929  0.669955  0.273359  0.108394  0.271152
3  0.653879  0.554300  0.225336  0.464994  0.229737  0.685335
4  0.198157  0.883008  0.835487  0.284703  0.704774  0.579999
5  0.924378  0.018207  0.471903  0.215904  0.025426  0.223028
6  0.782406  0.631878  0.510750  0.916153  0.770991  0.447247

In [10]:
#Ans4: 
mn=df1.describe()
mn.loc[['mean']]

      column_1  column_2  column_3  column_4  column_5  column_6
mean  0.552694  0.556554  0.464567  0.514782  0.372685  0.399607

In [11]:
mn.loc[['std'],['column_2']]

     column_2
std  0.348596

In [12]:
#Ans5:
df1['column_2']='Changed'

In [13]:
try:
    df1['column_2'].mean()
except Exception as e:
    print(e)
# we will get the error from the code because the column_2 has only string data while mean function can only be applied to the 
# integer value only.

Could not convert ChangedChangedChangedChangedChangedChanged to numeric

In [14]:
#Ans6: window functions are the functions in pandas which is used to perform certain action on a number of rows in a dataset at same time.
#    It helps to select the more then one rows without using any other things.
    The types of rolling functions are: 
        (i). rolling
        (ii). expending
        (iii). ewm

In [20]:
#Ans7: 
fd=pd.DataFrame(i,columns=['date'])
i=['2023-03-05','2023-03-04']

In [35]:
fd['date']=pd.to_datetime(fd['date'])
print(fd['date'].dt.year)
print(fd['date'].dt.month)

0    2023
1    2023
Name: date, dtype: int64
0    3
1    3
Name: date, dtype: int64

In [41]:
#Ans8:
in_date=input("Enter starting date: ")
fn_date=input("Enter final date: ")
start=pd.to_datetime(in_date)
end=pd.to_datetime(fn_date)
pd.Timedelta(end-start)

Enter starting date:  2023-03-01
Enter final date:  2023-03-03

Timedelta('2 days 00:00:00')

In [45]:
path=input("Enter the path of the file: ")
col_name=input("Enter the name of column: ")
cate_order=list(input("Enter the category: "))

df5=pd.read_csv(path)

df5[col_name]=pd.Categorical(df5[col_name],categories=cate_order)

sorted_df=df5.sort_values(by=col_name)

print(sorted_df)

Enter the path of the file:  Titanic.csv
Enter the name of column:  parch
Enter the category:  2324

        sex   age  sibsp parch     fare embarked   class    who  alone  \
0      male  22.0      1     0   7.2500        S   Third    man  False
545    male  64.0      0     0  26.0000        S   First    man   True
546  female  19.0      1     0  26.0000        S  Second  woman  False
547    male   NaN      0     0  13.8625        C  Second    man   True
551    male  27.0      0     0  26.0000        S  Second    man   True
..      ...   ...    ...   ...      ...      ...     ...    ...    ...
13     male  39.0      1     5  31.2750        S   Third    man  False
25   female  38.0      1     5  31.3875        S   Third  woman  False
885  female  39.0      0     5  29.1250        Q   Third  woman  False
638  female  41.0      0     5  39.6875        S   Third  woman  False
678  female  43.0      1     6  46.9000        S   Third  woman  False

     survived
0           0
545         0
546         1
547         1
551         0
..        ...
13          0
25          1
885         0
638         0
678         0

[891 rows x 10 columns]

In [ ]:
#Ans10:
pth=input("Enter the path: ")
df6=pd.read_csv(pth)
smpl_df=df6['sales']
smpl_df.plot.pie()

In [9]:
#Ans11:
pt=input("Enter the path: ")
df7=pd.read_csv(pt)
details=df7.describe()
dt=details[['Test Score']]
new_df=pd.DataFrame(columns=['mean','median','mode'])
new_df['mean']=[df7['Test Score'].mean()]
new_df['median']=[df7['Test Score'].median()]
new_df['mode']=df7['Test Score'].mode()
new_df

Enter the path:  q11.csv

   mean  median  mode
0  83.5    85.0    85